ProgessBase/Documents/ПРГ_НачислениеПроцентовПоКредитам.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Document>
		<Properties>
			<Name>ПРГ_НачислениеПроцентовПоКредитам</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccountingRegister.Хозрасчетный</xr:Item>
				<xr:Item>AccountingRegister.Налоговый</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Рубли</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>НачислениеПроцентовПоКредитамИЗаймам</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Контрагент</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Договор</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаНачала</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаОкончания</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ФактС</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>6</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НормС</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>6</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Задолженность</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>19</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Валюта</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КолвоДнейГод</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КолвоДнейПер</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НачислениеПоФс</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>19</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сопостовимость</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СрУровень</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>19</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НачисленоПоСрУровню</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>19</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НачисленоПоНС</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>19</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Курс</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>4</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПоФс</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>19</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПоСрУр</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>19</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПоНС</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>19</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СчетКт</Name>
							<Type>
								<v8:Type>cfg:ChartOfAccountsRef.Хозрасчетный</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

ProgessBase/AccountingRegisters/Хозрасчетный.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<AccountingRegister>
		<Properties>
			<Name>Хозрасчетный</Name>
			<Comment>(Регл)</Comment>
			<ChartOfAccounts>ChartOfAccounts.Хозрасчетный</ChartOfAccounts>
			<Correspondence>true</Correspondence>
		</Properties>
		<ChildObjects>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
					<Balance>true</Balance>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Валюта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
					<Balance>false</Balance>
					<AccountingFlag>ChartOfAccounts.Хозрасчетный.AccountingFlag.Валютный</AccountingFlag>
				</Properties>
			</Dimension>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
					<Balance>true</Balance>
					<ExtDimensionAccountingFlag>ChartOfAccounts.Хозрасчетный.ExtDimensionAccountingFlag.Суммовой</ExtDimensionAccountingFlag>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВалютнаяСумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
					<Balance>false</Balance>
					<AccountingFlag>ChartOfAccounts.Хозрасчетный.AccountingFlag.Валютный</AccountingFlag>
					<ExtDimensionAccountingFlag>ChartOfAccounts.Хозрасчетный.ExtDimensionAccountingFlag.Валютный</ExtDimensionAccountingFlag>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
					<Balance>false</Balance>
					<AccountingFlag>ChartOfAccounts.Хозрасчетный.AccountingFlag.Количественный</AccountingFlag>
					<ExtDimensionAccountingFlag>ChartOfAccounts.Хозрасчетный.ExtDimensionAccountingFlag.Количественный</ExtDimensionAccountingFlag>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Содержание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерЖурнала</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>2</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СписаниеПартий</Name>
					<Comment>Запись сформирована при списании партий</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаЗаписи</Name>
					<Comment>Дата формирования проводки регламентной процедурой</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидРегламентнойОперации</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыРегламентныхОпераций</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НДСПродукции</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</AccountingRegister>
</MetaDataObject>

ProgessBase/AccountingRegisters/Налоговый.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<AccountingRegister>
		<Properties>
			<Name>Налоговый</Name>
			<Comment>(Регл)</Comment>
			<ChartOfAccounts>ChartOfAccounts.Налоговый</ChartOfAccounts>
			<Correspondence>true</Correspondence>
		</Properties>
		<ChildObjects>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
					<Balance>true</Balance>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидУчета</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыУчетаПоПБУ18</v8:Type>
					</Type>
					<Balance>false</Balance>
				</Properties>
			</Dimension>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
					<Balance>true</Balance>
					<ExtDimensionAccountingFlag>ChartOfAccounts.Налоговый.ExtDimensionAccountingFlag.Суммовой</ExtDimensionAccountingFlag>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
					<Balance>false</Balance>
					<AccountingFlag>ChartOfAccounts.Налоговый.AccountingFlag.Количественный</AccountingFlag>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>НомерЖурнала</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>2</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Содержание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СписаниеПартий</Name>
					<Comment>Запись сформирована при списании партий</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаЗаписи</Name>
					<Comment>Дата формирования проводки регламентной процедурой</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидРегламентнойОперации</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыРегламентныхОпераций</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СписаниеПартийНДС</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</AccountingRegister>
</MetaDataObject>

ProgessBase/Enums/ВидыУчетаПоПБУ18.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Enum>
		<Properties>
			<Name>ВидыУчетаПоПБУ18</Name>
			<Comment>(Регл)</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>НУ</Name>
					<Comment>Налоговый учет</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПР</Name>
					<Comment>Учет постоянных разниц</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВР</Name>
					<Comment>Учет временных разниц</Comment>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

ProgessBase/Enums/УсловияПоступленияИВыбытияИмущества.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Enum>
		<Properties>
			<Name>УсловияПоступленияИВыбытияИмущества</Name>
			<Comment>(Регл)</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ЗаПлату</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Возврат</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПоДоговоруЗайма</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Товароообмен</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВкладВУставныйКапитал</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВкладВПростоеТоварищество</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Недостачи</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СписаниеИмущества</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПередачаОбособленномуПодразделению</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Другие</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НеОблагается</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

ProgessBase/Documents/ПРГ_НачислениеПроцентовПоКредитам/Ext/ObjectModule.bsl
//Blik 291113
// Возвращает доступные варианты печати документа
//
// Возвращаемое значение:
//  Струткура, каждая строка которой соответствует одному из вариантов печати
//  
Функция ПолучитьСтруктуруПечатныхФорм() Экспорт
	
	СтруктураПечатныхФорм = Новый Структура;
	Возврат СтруктураПечатныхФорм;

КонецФункции

Процедура ОбработкаПроведения(Отказ)
	
	//Blik 230517 65309 н
	ДатаИзмененияНачисления = Дата(ПолучитьДатуИзмененияначисленияПроцентов());
	//Blik 230517 65309 к
	
	СтруктураОбязательныхПолей = Новый Структура("Организация",Организация);
	Заголовок = "";
	ЗаполнениеДокументов.ПроверитьЗаполнениеШапкиДокумента(ЭтотОбъект, СтруктураОбязательныхПолей, Отказ, Заголовок);
	Если Отказ Тогда
		возврат;
	КонецЕслИ;	
	
//	ПредставлениеРеквизита = ЭтотОбъект.Метаданные().Реквизиты.Событие.Представление();
								  
	Если Отказ Тогда
		возврат;
	КонецЕслИ;	
	
	НайденнаяСсылкаПроц = Справочники.ПрочиеДоходыИРасходы.НайтиПоКоду("Р-4.3.144");//"ОР-2.1");
	Если НайденнаяСсылкаПроц = Справочники.ПрочиеДоходыИРасходы.ПустаяСсылка() тогда
		Проц = Справочники.ПрочиеДоходыИРасходы.ПустаяСсылка();
	Иначе
		Проц = НайденнаяСсылкаПроц;
	КонецЕсли;
	НайденнаяСсылкаПроцСН = Справочники.ПрочиеДоходыИРасходы.НайтиПоКоду("Р-4.3.144");//"ОР-2.1.1");
	Если НайденнаяСсылкаПроцСН = Справочники.ПрочиеДоходыИРасходы.ПустаяСсылка() тогда
		ПроцСН = Справочники.ПрочиеДоходыИРасходы.ПустаяСсылка();
	Иначе
		ПроцСн = НайденнаяСсылкаПроцСН;
	КонецЕсли;

	
	Запрос = Новый Запрос;	
	Запрос .Текст = 
	
	"ВЫБРАТЬ
	|	ПРГ_НачислениеПроцентовПоКредитамНачислениеПроцентовПоКредитамИЗаймам.ПоФс КАК ПоФс,
	|	ПРГ_НачислениеПроцентовПоКредитамНачислениеПроцентовПоКредитамИЗаймам.ПоСрУр КАК ПоСрУр,
	|	ПРГ_НачислениеПроцентовПоКредитамНачислениеПроцентовПоКредитамИЗаймам.ПоНС КАК ПоНС,
	|	ПРГ_НачислениеПроцентовПоКредитамНачислениеПроцентовПоКредитамИЗаймам.СчетКт КАК СчетКт,
	|	ПРГ_НачислениеПроцентовПоКредитамНачислениеПроцентовПоКредитамИЗаймам.Валюта КАК Валюта,
	|	ПРГ_НачислениеПроцентовПоКредитамНачислениеПроцентовПоКредитамИЗаймам.Контрагент КАК Контрагент,
	|	ПРГ_НачислениеПроцентовПоКредитамНачислениеПроцентовПоКредитамИЗаймам.Договор КАК Договор,
	|	ПРГ_НачислениеПроцентовПоКредитамНачислениеПроцентовПоКредитамИЗаймам.НачисленоПоНС КАК НачисленоПоНС,
	|	ПРГ_НачислениеПроцентовПоКредитамНачислениеПроцентовПоКредитамИЗаймам.НачисленоПоСрУровню КАК НачисленоПоСрУровню,
	|	ПРГ_НачислениеПроцентовПоКредитамНачислениеПроцентовПоКредитамИЗаймам.НачислениеПоФс КАК НачислениеПоФс,
	|	Началопериода(ПРГ_НачислениеПроцентовПоКредитамНачислениеПроцентовПоКредитамИЗаймам.Договор.Дата,День) КАК ДатаДоговора
	|ИЗ
	|	Документ.ПРГ_НачислениеПроцентовПоКредитам.НачислениеПроцентовПоКредитамИЗаймам КАК ПРГ_НачислениеПроцентовПоКредитамНачислениеПроцентовПоКредитамИЗаймам
	|ГДЕ
	|	ПРГ_НачислениеПроцентовПоКредитамНачислениеПроцентовПоКредитамИЗаймам.Ссылка = &Ссылка";
	
    Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	Результат = Запрос.Выполнить();

	ВыборкаДетальныеЗаписи = Результат.Выбрать();
    ПроводкиБУ=Движения.Хозрасчетный;
	ПроводкиБУ.Записывать=Истина;
	ПроводкиНУ = Движения.Налоговый;
	
	ПроводкиНУ.Записывать = ИСТИНА;
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		//Blik 230517 65309 н
		Если ВыборкаДетальныеЗаписи.ДатаДоговора < ДатаИзмененияНачисления Тогда
			ФормированиеПроводок(ВыборкаДетальныеЗаписи,ПроводкиБУ,ПроводкиНУ,Проц,ПроцСн);
		Иначе
			ФормированиеПроводок_НовыеПравила(ВыборкаДетальныеЗаписи,ПроводкиБУ,ПроводкиНУ,Проц,ПроцСн);
		КонецЕсли;
		//Blik 230517 65309 н
		
		//Если Ссылка.Рубли = Истина тогда
		//	Если ВыборкаДетальныеЗаписи.ПоФс<ВыборкаДетальныеЗаписи.ПоНС Тогда 
		//		//списываем все что начислили можем приянть к ну
		//		Проводка   = ПроводкиБУ.Добавить();
		//		
		//		Проводка.Период                  = Дата;
		//		Проводка.Организация             = Организация;
		//		Проводка.Содержание              = "начисление процентов по кредитам и займам за ";
		//		Проводка.Сумма                   = ВыборкаДетальныеЗаписи.ПоФс;
		//		Проводка.СчетКт                  = ВыборкаДетальныеЗаписи.СчетКт;
		//		
		//		БухгалтерскийУчет.УстановитьСубконто(Проводка.СчетКт, Проводка.СубконтоКт, "Контрагенты"	,ВыборкаДетальныеЗаписи.Контрагент);
		//		БухгалтерскийУчет.УстановитьСубконто(Проводка.СчетКт, Проводка.СубконтоКт, "Договоры"		,ВыборкаДетальныеЗаписи.Договор);
		//		
		//		Проводка.СчетДт                  = ПланыСчетов.Хозрасчетный.ПрочиеРасходыНеОблагаемыеЕНВД;
		//		БухгалтерскийУчет.УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, "ПрочиеДоходыИРасходы"		,Проц);
		//		БухгалтерскийУчет.УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, "ПодразделениеОрганизации", Подразделение);
		//		
		//		//проведение по НУ
		//		ПроводкаНУ = ПроводкиНУ.Добавить();
		//		
		//		ПроводкаНУ.Период               = Дата;
		//		ПроводкаНУ.Организация          = Организация;
		//		ПроводкаНУ.Содержание           = "начисление процентов по кредитам и займам в НУ";
		//		ПроводкаНУ.ВидУчетаДт           = Перечисления.ВидыУчетаПоПБУ18.НУ;
		//		ПроводкаНУ.Сумма                = ВыборкаДетальныеЗаписи.ПоФс;
		//		ПроводкаНУ.СчетДт               = ПланыСчетов.Налоговый.ВнереализационныеРасходы;//ПланыСчетов.Налоговый.ВнереализационныеДоходы; //Blik 230414 испр
		//		БухгалтерскийУчет.УстановитьСубконто(ПроводкаНУ.СчетДт, ПроводкаНУ.СубконтоДт, "ПрочиеДоходыИРасходы"		,Проц);
		//		//Blik 230414 доб н
		//		ПроводкаНУ.СчетКт               = ПланыСчетов.Налоговый.ПоступлениеИВыбытиеИмуществаРаботУслугПрав; 
		//		ПроводкаНУ.ВидУчетаКт           = Перечисления.ВидыУчетаПоПБУ18.НУ;
		//		БухгалтерскийУчет.УстановитьСубконто(ПроводкаНУ.СчетКт, ПроводкаНУ.СубконтоКт, "УсловияПоступленияИВыбытия"	,Перечисления.УсловияПоступленияИВыбытияИмущества.ПоДоговоруЗайма);
		//		БухгалтерскийУчет.УстановитьСубконто(ПроводкаНУ.СчетКт, ПроводкаНУ.СубконтоКт, "Контрагенты"	,ВыборкаДетальныеЗаписи.Контрагент);
		//		БухгалтерскийУчет.УстановитьСубконто(ПроводкаНУ.СчетКт, ПроводкаНУ.СубконтоКт, "Договоры"		,ВыборкаДетальныеЗаписи.Договор);
		//		//Blik 230414 доб к
		//	Иначе
		//		
		//		// списываемпо по нормируемой ставке, это можно принять к ну
		//		Проводка   = ПроводкиБУ.Добавить();
		//		
		//		Проводка.Период                  = Дата;
		//		Проводка.Организация             = Организация;
		//		Проводка.Содержание              = "начисление процентов по кредитам и займам за ";
		//		Проводка.Сумма                   = ВыборкаДетальныеЗаписи.ПоНС;
		//		Проводка.СчетКт                  = ВыборкаДетальныеЗаписи.СчетКт;
		//		
		//		БухгалтерскийУчет.УстановитьСубконто(Проводка.СчетКт, Проводка.СубконтоКт, "Контрагенты"	,ВыборкаДетальныеЗаписи.Контрагент);
		//		БухгалтерскийУчет.УстановитьСубконто(Проводка.СчетКт, Проводка.СубконтоКт, "Договоры"		,ВыборкаДетальныеЗаписи.Договор);
		//		
		//		Проводка.СчетДт                  = ПланыСчетов.Хозрасчетный.ПрочиеРасходыНеОблагаемыеЕНВД;
		//		БухгалтерскийУчет.УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, "ПрочиеДоходыИРасходы"		,Проц);
		//	   БухгалтерскийУчет.УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, "ПодразделениеОрганизации", Подразделение);
		//		//проведение по НУ
		//		ПроводкаНУ = ПроводкиНУ.Добавить();
		//		
		//		ПроводкаНУ.Период               = Дата;
		//		ПроводкаНУ.Организация          = Организация;
		//		ПроводкаНУ.Содержание           = "начисление процентов по кредитам и займам в НУ";
		//		ПроводкаНУ.ВидУчетаДт           = Перечисления.ВидыУчетаПоПБУ18.НУ;
		//		ПроводкаНУ.Сумма                = ВыборкаДетальныеЗаписи.ПоНс;
		//		ПроводкаНУ.СчетДт               = ПланыСчетов.Налоговый.ВнереализационныеРасходы;//ПланыСчетов.Налоговый.ВнереализационныеДоходы; //Blik 230414 испр
		//		БухгалтерскийУчет.УстановитьСубконто(ПроводкаНУ.СчетДт, ПроводкаНУ.СубконтоДт, "ПрочиеДоходыИРасходы"		,Проц);
		//		//Blik 230414 доб н
		//		ПроводкаНУ.СчетКт               = ПланыСчетов.Налоговый.ПоступлениеИВыбытиеИмуществаРаботУслугПрав; 
		//		ПроводкаНУ.ВидУчетаКт           = Перечисления.ВидыУчетаПоПБУ18.НУ;
		//		БухгалтерскийУчет.УстановитьСубконто(ПроводкаНУ.СчетКт, ПроводкаНУ.СубконтоКт, "УсловияПоступленияИВыбытия"	,Перечисления.УсловияПоступленияИВыбытияИмущества.ПоДоговоруЗайма);
		//		БухгалтерскийУчет.УстановитьСубконто(ПроводкаНУ.СчетКт, ПроводкаНУ.СубконтоКт, "Контрагенты"	,ВыборкаДетальныеЗаписи.Контрагент);
		//		БухгалтерскийУчет.УстановитьСубконто(ПроводкаНУ.СчетКт, ПроводкаНУ.СубконтоКт, "Договоры"		,ВыборкаДетальныеЗаписи.Договор);
		//		//Blik 230414 доб к

		//		//списываем остаток ПоФс-ПоНС эту часть суммы не можем принять к ну 
		//		Проводка   = ПроводкиБУ.Добавить();
		//		
		//		Проводка.Период                  = Дата;
		//		Проводка.Организация             = Организация;
		//		Проводка.Содержание              = "начисление процентов по кредитам и займам  не принимаемые к НУ ";
		//		Проводка.Сумма                   = ВыборкаДетальныеЗаписи.ПоФС-ВыборкаДетальныеЗаписи.ПоНС;
		//		Проводка.СчетКт                  = ВыборкаДетальныеЗаписи.СчетКт;
		//		
		//		БухгалтерскийУчет.УстановитьСубконто(Проводка.СчетКт, Проводка.СубконтоКт, "Контрагенты"	,ВыборкаДетальныеЗаписи.Контрагент);
		//		БухгалтерскийУчет.УстановитьСубконто(Проводка.СчетКт, Проводка.СубконтоКт, "Договоры"		,ВыборкаДетальныеЗаписи.Договор);
		//		
		//		Проводка.СчетДт                  = ПланыСчетов.Хозрасчетный.ПрочиеРасходыНеОблагаемыеЕНВД;
		//		БухгалтерскийУчет.УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, "ПрочиеДоходыИРасходы"		,ПроцСН);
		//		БухгалтерскийУчет.УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, "ПодразделениеОрганизации", Подразделение);
		//		//проведение по НУ
		//		ПроводкаНУ = ПроводкиНУ.Добавить();
		//		
		//		ПроводкаНУ.Период               = Дата;
		//		ПроводкаНУ.Организация          = Организация;
		//		ПроводкаНУ.Содержание           = "начисление процентов по кредитам и займам в НУ";
		//		ПроводкаНУ.ВидУчетаДт           = Перечисления.ВидыУчетаПоПБУ18.ПР;
		//		ПроводкаНУ.Сумма                = ВыборкаДетальныеЗаписи.ПоФс-ВыборкаДетальныеЗаписи.ПоНс;
		//		ПроводкаНУ.СчетДт               = ПланыСчетов.Налоговый.ВнереализационныеРасходы;//ПланыСчетов.Налоговый.ВнереализационныеДоходы; //Blik 230414 испр
		//		БухгалтерскийУчет.УстановитьСубконто(ПроводкаНУ.СчетДт, ПроводкаНУ.СубконтоДт, "ПрочиеДоходыИРасходы"		,ПроцСН);
		//		//Blik 230414 доб н
		//		ПроводкаНУ.СчетКт               = ПланыСчетов.Налоговый.ПоступлениеИВыбытиеИмуществаРаботУслугПрав; 
		//		ПроводкаНУ.ВидУчетаКт           = Перечисления.ВидыУчетаПоПБУ18.НУ;
		//		БухгалтерскийУчет.УстановитьСубконто(ПроводкаНУ.СчетКт, ПроводкаНУ.СубконтоКт, "УсловияПоступленияИВыбытия"	,Перечисления.УсловияПоступленияИВыбытияИмущества.ПоДоговоруЗайма);
		//		БухгалтерскийУчет.УстановитьСубконто(ПроводкаНУ.СчетКт, ПроводкаНУ.СубконтоКт, "Контрагенты"	,ВыборкаДетальныеЗаписи.Контрагент);
		//		БухгалтерскийУчет.УстановитьСубконто(ПроводкаНУ.СчетКт, ПроводкаНУ.СубконтоКт, "Договоры"		,ВыборкаДетальныеЗаписи.Договор);
		//		//доп проводка
		//		ПроводкаНУ = ПроводкиНУ.Добавить();
		//		ПроводкаНУ.Период               = Дата;
		//		ПроводкаНУ.Организация          = Организация;
		//		ПроводкаНУ.Содержание           = "начисление процентов по кредитам и займам в НУ";
		//		ПроводкаНУ.ВидУчетаДт           = Перечисления.ВидыУчетаПоПБУ18.НУ;
		//		ПроводкаНУ.Сумма                = ВыборкаДетальныеЗаписи.ПоФс-ВыборкаДетальныеЗаписи.ПоНс;
		//		ПроводкаНУ.СчетДт               = ПланыСчетов.Налоговый.ВнереализационныеРасходыНеУчитываемые;
		//		//Blik 230414 доб к

		//	КонецЕсли;
		//Иначе
		//				
		//	Если ВыборкаДетальныеЗаписи.ПоСрУр>0 Тогда   //расчет если есть суммы по ср уровню начисления
		//		Если ВыборкаДетальныеЗаписи.ПоФс<ВыборкаДетальныеЗаписи.ПоСрУр Тогда 
		//			//списываем все что начислили можем приянть к ну
		//			Проводка   = ПроводкиБУ.Добавить();
		//			
		//			Проводка.Период                  = Дата;
		//			Проводка.Организация             = Организация;
		//			Проводка.Содержание              = "начисление процентов по кредитам и займам за ";
		//			Проводка.сумма                   = ВыборкаДетальныеЗаписи.ПоФС;
		//			Если ВыборкаДетальныеЗаписи.СчетКт.Валютный Тогда
		//				Проводка.ВалютнаяСуммаКт    = ВыборкаДетальныеЗаписи.НачислениеПоФс; 
		//				Проводка.ВалютаКт             = ВыборкаДетальныеЗаписи.Валюта;
		//			КонецЕсли;
		//			Проводка.СчетКт                  = ВыборкаДетальныеЗаписи.СчетКт;
		//			
		//			БухгалтерскийУчет.УстановитьСубконто(Проводка.СчетКт, Проводка.СубконтоКт, "Контрагенты"	,ВыборкаДетальныеЗаписи.Контрагент);
		//			БухгалтерскийУчет.УстановитьСубконто(Проводка.СчетКт, Проводка.СубконтоКт, "Договоры"		,ВыборкаДетальныеЗаписи.Договор);
		//			
		//			Проводка.СчетДт                  = ПланыСчетов.Хозрасчетный.ПрочиеРасходыНеОблагаемыеЕНВД;
		//			
		//			БухгалтерскийУчет.УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, "ПрочиеДоходыИРасходы"		,Проц);
		//			БухгалтерскийУчет.УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, "ПодразделениеОрганизации", Подразделение);
		//			//проведение по НУ
		//			ПроводкаНУ = ПроводкиНУ.Добавить();
		//			
		//			ПроводкаНУ.Период               = Дата;
		//			ПроводкаНУ.Организация          = Организация;
		//			ПроводкаНУ.Содержание           = "начисление процентов по кредитам и займам в НУ";
		//			ПроводкаНУ.ВидУчетаДт           = Перечисления.ВидыУчетаПоПБУ18.НУ;
		//			ПроводкаНУ.Сумма                = ВыборкаДетальныеЗаписи.ПоФс;
		//			ПроводкаНУ.СчетДт               = ПланыСчетов.Налоговый.ВнереализационныеРасходы;//ПланыСчетов.Налоговый.ВнереализационныеДоходы; //Blik 230414 испр
		//			БухгалтерскийУчет.УстановитьСубконто(ПроводкаНУ.СчетДт, ПроводкаНУ.СубконтоДт, "ПрочиеДоходыИРасходы"		,Проц);
		//			//Blik 230414 доб н
		//			ПроводкаНУ.СчетКт               = ПланыСчетов.Налоговый.ПоступлениеИВыбытиеИмуществаРаботУслугПрав; 
		//			ПроводкаНУ.ВидУчетаКт           = Перечисления.ВидыУчетаПоПБУ18.НУ;
		//			БухгалтерскийУчет.УстановитьСубконто(ПроводкаНУ.СчетКт, ПроводкаНУ.СубконтоКт, "УсловияПоступленияИВыбытия"	,Перечисления.УсловияПоступленияИВыбытияИмущества.ПоДоговоруЗайма);
		//			БухгалтерскийУчет.УстановитьСубконто(ПроводкаНУ.СчетКт, ПроводкаНУ.СубконтоКт, "Контрагенты"	,ВыборкаДетальныеЗаписи.Контрагент);
		//			БухгалтерскийУчет.УстановитьСубконто(ПроводкаНУ.СчетКт, ПроводкаНУ.СубконтоКт, "Договоры"		,ВыборкаДетальныеЗаписи.Договор);
		//			//Blik 230414 доб к
		//		Иначе
		//			// списываемпо ср уровню, это можно принять к ну
		//			Проводка   = ПроводкиБУ.Добавить();
		//			
		//			Проводка.Период                  = Дата;
		//			Проводка.Организация             = Организация;
		//			Проводка.Содержание              = "начисление процентов по кредитам и займам за ";
		//			Проводка.Сумма                   = ВыборкаДетальныеЗаписи.ПоСрУр;
		//			Если ВыборкаДетальныеЗаписи.СчетКт.Валютный Тогда
		//				Проводка.ВалютнаяСуммаКт      = ВыборкаДетальныеЗаписи.НачисленоПоСрУровню; 
		//				Проводка.ВалютаКт             = ВыборкаДетальныеЗаписи.Валюта;
		//			КонецЕсли;
		//			Проводка.СчетКт                  = ВыборкаДетальныеЗаписи.СчетКт;
		//			
		//			БухгалтерскийУчет.УстановитьСубконто(Проводка.СчетКт, Проводка.СубконтоКт, "Контрагенты"	,ВыборкаДетальныеЗаписи.Контрагент);
		//			БухгалтерскийУчет.УстановитьСубконто(Проводка.СчетКт, Проводка.СубконтоКт, "Договоры"		,ВыборкаДетальныеЗаписи.Договор);
		//			
		//			Проводка.СчетДт                  = ПланыСчетов.Хозрасчетный.ПрочиеРасходыНеОблагаемыеЕНВД;
		//			
		//			БухгалтерскийУчет.УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, "ПрочиеДоходыИРасходы"		,Проц);
		//			БухгалтерскийУчет.УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, "ПодразделениеОрганизации", Подразделение);
		//			//проведение по НУ
		//			ПроводкаНУ = ПроводкиНУ.Добавить();
		//			
		//			ПроводкаНУ.Период               = Дата;
		//			ПроводкаНУ.Организация          = Организация;
		//			ПроводкаНУ.Содержание           = "начисление процентов по кредитам и займам в НУ";
		//			ПроводкаНУ.ВидУчетаДт           = Перечисления.ВидыУчетаПоПБУ18.НУ;
		//			ПроводкаНУ.Сумма                = ВыборкаДетальныеЗаписи.ПоСрУр;
		//			ПроводкаНУ.СчетДт               = ПланыСчетов.Налоговый.ВнереализационныеРасходы;//ПланыСчетов.Налоговый.ВнереализационныеДоходы; //Blik 230414 испр
		//			БухгалтерскийУчет.УстановитьСубконто(ПроводкаНУ.СчетДт, ПроводкаНУ.СубконтоДт, "ПрочиеДоходыИРасходы"		,Проц);
		//			//Blik 230414 доб н
		//			ПроводкаНУ.СчетКт               = ПланыСчетов.Налоговый.ПоступлениеИВыбытиеИмуществаРаботУслугПрав; 
		//			ПроводкаНУ.ВидУчетаКт           = Перечисления.ВидыУчетаПоПБУ18.НУ;
		//			БухгалтерскийУчет.УстановитьСубконто(ПроводкаНУ.СчетКт, ПроводкаНУ.СубконтоКт, "УсловияПоступленияИВыбытия"	,Перечисления.УсловияПоступленияИВыбытияИмущества.ПоДоговоруЗайма);
		//			БухгалтерскийУчет.УстановитьСубконто(ПроводкаНУ.СчетКт, ПроводкаНУ.СубконтоКт, "Контрагенты"	,ВыборкаДетальныеЗаписи.Контрагент);
		//			БухгалтерскийУчет.УстановитьСубконто(ПроводкаНУ.СчетКт, ПроводкаНУ.СубконтоКт, "Договоры"		,ВыборкаДетальныеЗаписи.Договор);
		//			//Blik 230414 доб к
		//			
		//			//списываем остаток ПоФс-ПоСрУр эту часть суммы не можем принять к ну 
		//			Проводка   = ПроводкиБУ.Добавить();
		//			
		//			Проводка.Период                  = Дата;
		//			Проводка.Организация             = Организация;
		//			Проводка.Содержание              = "начисление процентов по кредитам и займам за ";
		//			Проводка.Сумма                   = ВыборкаДетальныеЗаписи.ПоФС-ВыборкаДетальныеЗаписи.ПоСрУр;
		//			Если ВыборкаДетальныеЗаписи.СчетКт.Валютный Тогда
		//				Проводка.ВалютнаяСуммаКт      = ВыборкаДетальныеЗаписи.НачислениеПоФс- ВыборкаДетальныеЗаписи.НачисленоПоСрУровню; 
		//				Проводка.ВалютаКт             = ВыборкаДетальныеЗаписи.Валюта;
		//			КонецЕсли;
		//			Проводка.СчетКт                  = ВыборкаДетальныеЗаписи.СчетКт;
		//			
		//			БухгалтерскийУчет.УстановитьСубконто(Проводка.СчетКт, Проводка.СубконтоКт, "Контрагенты"	,ВыборкаДетальныеЗаписи.Контрагент);
		//			БухгалтерскийУчет.УстановитьСубконто(Проводка.СчетКт, Проводка.СубконтоКт, "Договоры"		,ВыборкаДетальныеЗаписи.Договор);
		//			
		//			Проводка.СчетДт                  = ПланыСчетов.Хозрасчетный.ПрочиеРасходыНеОблагаемыеЕНВД;
		//			
		//			БухгалтерскийУчет.УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, "ПрочиеДоходыИРасходы"		,ПроцСН);
		//			БухгалтерскийУчет.УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, "ПодразделениеОрганизации", Подразделение);
		//			//проведение по НУ
		//			ПроводкаНУ = ПроводкиНУ.Добавить();
		//			ПроводкаНУ.Период               = Дата;
		//			ПроводкаНУ.Организация          = Организация;
		//			ПроводкаНУ.Содержание           = "начисление процентов по кредитам и займам в НУ";
		//			ПроводкаНУ.ВидУчетаДт           = Перечисления.ВидыУчетаПоПБУ18.ПР;
		//			ПроводкаНУ.Сумма                = ВыборкаДетальныеЗаписи.ПоФС-ВыборкаДетальныеЗаписи.ПоСрУр;
		//			ПроводкаНУ.СчетДт               = ПланыСчетов.Налоговый.ВнереализационныеРасходы;//ПланыСчетов.Налоговый.ВнереализационныеДоходы; //Blik 230414 испр
		//			БухгалтерскийУчет.УстановитьСубконто(ПроводкаНУ.СчетДт, ПроводкаНУ.СубконтоДт, "ПрочиеДоходыИРасходы"		,ПроцСН);
		//			//Blik 230414 доб н
		//			ПроводкаНУ.СчетКт               = ПланыСчетов.Налоговый.ПоступлениеИВыбытиеИмуществаРаботУслугПрав; 
		//			ПроводкаНУ.ВидУчетаКт           = Перечисления.ВидыУчетаПоПБУ18.НУ;
		//			БухгалтерскийУчет.УстановитьСубконто(ПроводкаНУ.СчетКт, ПроводкаНУ.СубконтоКт, "УсловияПоступленияИВыбытия"	,Перечисления.УсловияПоступленияИВыбытияИмущества.ПоДоговоруЗайма);
		//			БухгалтерскийУчет.УстановитьСубконто(ПроводкаНУ.СчетКт, ПроводкаНУ.СубконтоКт, "Контрагенты"	,ВыборкаДетальныеЗаписи.Контрагент);
		//			БухгалтерскийУчет.УстановитьСубконто(ПроводкаНУ.СчетКт, ПроводкаНУ.СубконтоКт, "Договоры"		,ВыборкаДетальныеЗаписи.Договор);
		//			//доп проводка
		//			ПроводкаНУ = ПроводкиНУ.Добавить();
		//			ПроводкаНУ.Период               = Дата;
		//			ПроводкаНУ.Организация          = Организация;
		//			ПроводкаНУ.Содержание           = "начисление процентов по кредитам и займам в НУ";
		//			ПроводкаНУ.ВидУчетаДт           = Перечисления.ВидыУчетаПоПБУ18.НУ;
		//			ПроводкаНУ.Сумма                = ВыборкаДетальныеЗаписи.ПоФс-ВыборкаДетальныеЗаписи.ПоСрУр;
		//			ПроводкаНУ.СчетДт               = ПланыСчетов.Налоговый.ВнереализационныеРасходыНеУчитываемые;
		//			//Blik 230414 доб к

		//		КонецЕсли;
		//	КонецЕсли;
		//	Если ВыборкаДетальныеЗаписи.ПоНС>0 Тогда   //расчет если есть суммы по нормируемой ставке
		//		Если ВыборкаДетальныеЗаписи.ПоФс<ВыборкаДетальныеЗаписи.ПоНС Тогда 
		//			//списываем все что начислили можем приянть к ну
		//			Проводка   = ПроводкиБУ.Добавить();
		//			
		//			Проводка.Период                  = Дата;
		//			Проводка.Организация             = Организация;
		//			Проводка.Содержание              = "начисление процентов по кредитам и займам за ";
		//			Проводка.Сумма                   = ВыборкаДетальныеЗаписи.ПоФС;
		//			Если ВыборкаДетальныеЗаписи.СчетКт.Валютный Тогда
		//				Проводка.ВалютнаяСуммаКт      = ВыборкаДетальныеЗаписи.НачислениеПоФс; 
		//				Проводка.ВалютаКт             = ВыборкаДетальныеЗаписи.Валюта;
		//			КонецЕсли;
		//			Проводка.СчетКт                  = ВыборкаДетальныеЗаписи.СчетКт;
		//			
		//			БухгалтерскийУчет.УстановитьСубконто(Проводка.СчетКт, Проводка.СубконтоКт, "Контрагенты"	,ВыборкаДетальныеЗаписи.Контрагент);
		//			БухгалтерскийУчет.УстановитьСубконто(Проводка.СчетКт, Проводка.СубконтоКт, "Договоры"		,ВыборкаДетальныеЗаписи.Договор);
		//			
		//			Проводка.СчетДт                  = ПланыСчетов.Хозрасчетный.ПрочиеРасходыНеОблагаемыеЕНВД;
		//			
		//			БухгалтерскийУчет.УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, "ПрочиеДоходыИРасходы"		,Проц);
		//			БухгалтерскийУчет.УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, "ПодразделениеОрганизации", Подразделение);
		//			//проведение по НУ
		//			ПроводкаНУ = ПроводкиНУ.Добавить();
		//			
		//			ПроводкаНУ.Период               = Дата;
		//			ПроводкаНУ.Организация          = Организация;
		//			ПроводкаНУ.Содержание           = "начисление процентов по кредитам и займам в НУ";
		//			ПроводкаНУ.ВидУчетаДт           = Перечисления.ВидыУчетаПоПБУ18.НУ;
		//			ПроводкаНУ.Сумма                = ВыборкаДетальныеЗаписи.ПоФС;
		//			ПроводкаНУ.СчетДт               = ПланыСчетов.Налоговый.ВнереализационныеРасходы;//ПланыСчетов.Налоговый.ВнереализационныеДоходы; //Blik 230414 испр
		//			БухгалтерскийУчет.УстановитьСубконто(ПроводкаНУ.СчетДт, ПроводкаНУ.СубконтоДт, "ПрочиеДоходыИРасходы"		,Проц);
		//			//Blik 230414 доб н
		//			ПроводкаНУ.СчетКт               = ПланыСчетов.Налоговый.ПоступлениеИВыбытиеИмуществаРаботУслугПрав; 
		//			ПроводкаНУ.ВидУчетаКт           = Перечисления.ВидыУчетаПоПБУ18.НУ;
		//			БухгалтерскийУчет.УстановитьСубконто(ПроводкаНУ.СчетКт, ПроводкаНУ.СубконтоКт, "УсловияПоступленияИВыбытия"	,Перечисления.УсловияПоступленияИВыбытияИмущества.ПоДоговоруЗайма);
		//			БухгалтерскийУчет.УстановитьСубконто(ПроводкаНУ.СчетКт, ПроводкаНУ.СубконтоКт, "Контрагенты"	,ВыборкаДетальныеЗаписи.Контрагент);
		//			БухгалтерскийУчет.УстановитьСубконто(ПроводкаНУ.СчетКт, ПроводкаНУ.СубконтоКт, "Договоры"		,ВыборкаДетальныеЗаписи.Договор);
		//			//Blik 230414 доб к
		//		Иначе
		//			// списываемпо по нормируемой ставке, это можно принять к ну
		//			Проводка   = ПроводкиБУ.Добавить();
		//			
		//			Проводка.Период                  = Дата;
		//			Проводка.Организация             = Организация;
		//			Проводка.Содержание              = "начисление процентов по кредитам и займам за ";
		//			Проводка.Сумма                   = ВыборкаДетальныеЗаписи.ПоНС;
		//			Если ВыборкаДетальныеЗаписи.СчетКт.Валютный Тогда
		//				Проводка.ВалютнаяСуммаКт      = ВыборкаДетальныеЗаписи.НачисленоПоНС; 
		//				Проводка.ВалютаКт             = ВыборкаДетальныеЗаписи.Валюта;
		//			КонецЕсли;
		//			Проводка.СчетКт                  = ВыборкаДетальныеЗаписи.СчетКт;
		//			
		//			БухгалтерскийУчет.УстановитьСубконто(Проводка.СчетКт, Проводка.СубконтоКт, "Контрагенты"	,ВыборкаДетальныеЗаписи.Контрагент);
		//			БухгалтерскийУчет.УстановитьСубконто(Проводка.СчетКт, Проводка.СубконтоКт, "Договоры"		,ВыборкаДетальныеЗаписи.Договор);
		//			
		//			Проводка.СчетДт                  = ПланыСчетов.Хозрасчетный.ПрочиеРасходыНеОблагаемыеЕНВД;
		//			
		//			БухгалтерскийУчет.УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, "ПрочиеДоходыИРасходы"		,Проц);
		//			БухгалтерскийУчет.УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, "ПодразделениеОрганизации", Подразделение);
		//			//проведение по НУ
		//			ПроводкаНУ = ПроводкиНУ.Добавить();
		//			
		//			ПроводкаНУ.Период               = Дата;
		//			ПроводкаНУ.Организация          = Организация;
		//			ПроводкаНУ.Содержание           = "начисление процентов по кредитам и займам в НУ";
		//			ПроводкаНУ.ВидУчетаДт           = Перечисления.ВидыУчетаПоПБУ18.НУ;
		//			ПроводкаНУ.Сумма                = ВыборкаДетальныеЗаписи.ПоНС;
		//			ПроводкаНУ.СчетДт               = ПланыСчетов.Налоговый.ВнереализационныеРасходы;//ПланыСчетов.Налоговый.ВнереализационныеДоходы; //Blik 230414 испр
		//			БухгалтерскийУчет.УстановитьСубконто(ПроводкаНУ.СчетДт, ПроводкаНУ.СубконтоДт, "ПрочиеДоходыИРасходы"		,Проц);
		//			//Blik 230414 доб н
		//			ПроводкаНУ.СчетКт               = ПланыСчетов.Налоговый.ПоступлениеИВыбытиеИмуществаРаботУслугПрав; 
		//			ПроводкаНУ.ВидУчетаКт           = Перечисления.ВидыУчетаПоПБУ18.НУ;
		//			БухгалтерскийУчет.УстановитьСубконто(ПроводкаНУ.СчетКт, ПроводкаНУ.СубконтоКт, "УсловияПоступленияИВыбытия"	,Перечисления.УсловияПоступленияИВыбытияИмущества.ПоДоговоруЗайма);
		//			БухгалтерскийУчет.УстановитьСубконто(ПроводкаНУ.СчетКт, ПроводкаНУ.СубконтоКт, "Контрагенты"	,ВыборкаДетальныеЗаписи.Контрагент);
		//			БухгалтерскийУчет.УстановитьСубконто(ПроводкаНУ.СчетКт, ПроводкаНУ.СубконтоКт, "Договоры"		,ВыборкаДетальныеЗаписи.Договор);
		//			//Blik 230414 доб к
		//			//списываем остаток ПоФс-ПоНС эту часть суммы не можем принять к ну 
		//			Проводка   = ПроводкиБУ.Добавить();
		//			
		//			Проводка.Период                  = Дата;
		//			Проводка.Организация             = Организация;
		//			Проводка.Содержание              = "начисление процентов по кредитам и займам  не принимаемые к НУ ";
		//			Проводка.Сумма                   = ВыборкаДетальныеЗаписи.ПоФС-ВыборкаДетальныеЗаписи.ПоНС;
		//			Если ВыборкаДетальныеЗаписи.СчетКт.Валютный Тогда
		//				Проводка.ВалютнаяСуммаКт      = ВыборкаДетальныеЗаписи.НачислениеПоФс- ВыборкаДетальныеЗаписи.НачисленоПоНС; 
		//				Проводка.ВалютаКт             = ВыборкаДетальныеЗаписи.Валюта;
		//			КонецЕсли;
		//			Проводка.СчетКт                  = ВыборкаДетальныеЗаписи.СчетКт;
		//			
		//			БухгалтерскийУчет.УстановитьСубконто(Проводка.СчетКт, Проводка.СубконтоКт, "Контрагенты"	,ВыборкаДетальныеЗаписи.Контрагент);
		//			БухгалтерскийУчет.УстановитьСубконто(Проводка.СчетКт, Проводка.СубконтоКт, "Договоры"		,ВыборкаДетальныеЗаписи.Договор);
		//			
		//			Проводка.СчетДт                  = ПланыСчетов.Хозрасчетный.ПрочиеРасходыНеОблагаемыеЕНВД;
		//			
		//			БухгалтерскийУчет.УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, "ПрочиеДоходыИРасходы"		,ПроцСН);
		//			БухгалтерскийУчет.УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, "ПодразделениеОрганизации", Подразделение);
		//			//проведение по НУ
		//			ПроводкаНУ = ПроводкиНУ.Добавить();
		//			
		//			ПроводкаНУ.Период               = Дата;
		//			ПроводкаНУ.Организация          = Организация;
		//			ПроводкаНУ.Содержание           = "начисление процентов по кредитам и займам в НУ";
		//			ПроводкаНУ.ВидУчетаДт           = Перечисления.ВидыУчетаПоПБУ18.ПР;
		//			ПроводкаНУ.Сумма                = ВыборкаДетальныеЗаписи.ПоФС-ВыборкаДетальныеЗаписи.ПоНС;
		//			ПроводкаНУ.СчетДт               = ПланыСчетов.Налоговый.ВнереализационныеРасходы;//ПланыСчетов.Налоговый.ВнереализационныеДоходы; //Blik 230414 испр
		//			БухгалтерскийУчет.УстановитьСубконто(ПроводкаНУ.СчетДт, ПроводкаНУ.СубконтоДт, "ПрочиеДоходыИРасходы"		,ПроцСН);
		//			//Blik 230414 доб н
		//			ПроводкаНУ.СчетКт               = ПланыСчетов.Налоговый.ПоступлениеИВыбытиеИмуществаРаботУслугПрав; 
		//			ПроводкаНУ.ВидУчетаКт           = Перечисления.ВидыУчетаПоПБУ18.НУ;
		//			БухгалтерскийУчет.УстановитьСубконто(ПроводкаНУ.СчетКт, ПроводкаНУ.СубконтоКт, "УсловияПоступленияИВыбытия"	,Перечисления.УсловияПоступленияИВыбытияИмущества.ПоДоговоруЗайма);
		//			БухгалтерскийУчет.УстановитьСубконто(ПроводкаНУ.СчетКт, ПроводкаНУ.СубконтоКт, "Контрагенты"	,ВыборкаДетальныеЗаписи.Контрагент);
		//			БухгалтерскийУчет.УстановитьСубконто(ПроводкаНУ.СчетКт, ПроводкаНУ.СубконтоКт, "Договоры"		,ВыборкаДетальныеЗаписи.Договор);
		//			//доп проводка
		//			ПроводкаНУ = ПроводкиНУ.Добавить();
		//			ПроводкаНУ.Период               = Дата;
		//			ПроводкаНУ.Организация          = Организация;
		//			ПроводкаНУ.Содержание           = "начисление процентов по кредитам и займам в НУ";
		//			ПроводкаНУ.ВидУчетаДт           = Перечисления.ВидыУчетаПоПБУ18.НУ;
		//			ПроводкаНУ.Сумма                = ВыборкаДетальныеЗаписи.ПоФс-ВыборкаДетальныеЗаписи.ПоНс;
		//			ПроводкаНУ.СчетДт               = ПланыСчетов.Налоговый.ВнереализационныеРасходыНеУчитываемые;
		//			//Blik 230414 доб к
		//		КонецЕсли;
		//	КонецЕсли;
		//КонецЕсли;
	КонецЦикла;
ПроводкиНУ.Записать(истина);	
КонецПроцедуры

//Blik 230517 65309 н
Функция ПолучитьДатуИзмененияначисленияПроцентов() Экспорт
	Возврат '20160101';
КонецФункции

Функция ФормированиеПроводок(ВыборкаДетальныеЗаписи,ПроводкиБУ,ПроводкиНУ,Проц,ПроцСн)
	
//Сообщить("Формирование проводок по старым правилам");

	 Если Ссылка.Рубли = Истина тогда
			Если ВыборкаДетальныеЗаписи.ПоФс<ВыборкаДетальныеЗаписи.ПоНС Тогда 
				//списываем все что начислили можем приянть к ну
				Проводка   = ПроводкиБУ.Добавить();
				
				Проводка.Период                  = Дата;
				Проводка.Организация             = Организация;
				Проводка.Содержание              = "начисление процентов по кредитам и займам за ";
				Проводка.Сумма                   = ВыборкаДетальныеЗаписи.ПоФс;
				Проводка.СчетКт                  = ВыборкаДетальныеЗаписи.СчетКт;
				
				БухгалтерскийУчет.УстановитьСубконто(Проводка.СчетКт, Проводка.СубконтоКт, "Контрагенты"	,ВыборкаДетальныеЗаписи.Контрагент);
				БухгалтерскийУчет.УстановитьСубконто(Проводка.СчетКт, Проводка.СубконтоКт, "Договоры"		,ВыборкаДетальныеЗаписи.Договор);
				
				Проводка.СчетДт                  = ПланыСчетов.Хозрасчетный.ПрочиеРасходыНеОблагаемыеЕНВД;
				БухгалтерскийУчет.УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, "ПрочиеДоходыИРасходы"		,Проц);
				БухгалтерскийУчет.УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, "ПодразделениеОрганизации", Подразделение);
				
				//проведение по НУ
				ПроводкаНУ = ПроводкиНУ.Добавить();
				
				ПроводкаНУ.Период               = Дата;
				ПроводкаНУ.Организация          = Организация;
				ПроводкаНУ.Содержание           = "начисление процентов по кредитам и займам в НУ";
				ПроводкаНУ.ВидУчетаДт           = Перечисления.ВидыУчетаПоПБУ18.НУ;
				ПроводкаНУ.Сумма                = ВыборкаДетальныеЗаписи.ПоФс;
				ПроводкаНУ.СчетДт               = ПланыСчетов.Налоговый.ВнереализационныеРасходы;//ПланыСчетов.Налоговый.ВнереализационныеДоходы; //Blik 230414 испр
				БухгалтерскийУчет.УстановитьСубконто(ПроводкаНУ.СчетДт, ПроводкаНУ.СубконтоДт, "ПрочиеДоходыИРасходы"		,Проц);
				//Blik 230414 доб н
				ПроводкаНУ.СчетКт               = ПланыСчетов.Налоговый.ПоступлениеИВыбытиеИмуществаРаботУслугПрав; 
				ПроводкаНУ.ВидУчетаКт           = Перечисления.ВидыУчетаПоПБУ18.НУ;
				БухгалтерскийУчет.УстановитьСубконто(ПроводкаНУ.СчетКт, ПроводкаНУ.СубконтоКт, "УсловияПоступленияИВыбытия"	,Перечисления.УсловияПоступленияИВыбытияИмущества.ПоДоговоруЗайма);
				БухгалтерскийУчет.УстановитьСубконто(ПроводкаНУ.СчетКт, ПроводкаНУ.СубконтоКт, "Контрагенты"	,ВыборкаДетальныеЗаписи.Контрагент);
				БухгалтерскийУчет.УстановитьСубконто(ПроводкаНУ.СчетКт, ПроводкаНУ.СубконтоКт, "Договоры"		,ВыборкаДетальныеЗаписи.Договор);
				//Blik 230414 доб к
			Иначе
				
				// списываемпо по нормируемой ставке, это можно принять к ну
				Проводка   = ПроводкиБУ.Добавить();
				
				Проводка.Период                  = Дата;
				Проводка.Организация             = Организация;
				Проводка.Содержание              = "начисление процентов по кредитам и займам за ";
				Проводка.Сумма                   = ВыборкаДетальныеЗаписи.ПоНС;
				Проводка.СчетКт                  = ВыборкаДетальныеЗаписи.СчетКт;
				
				БухгалтерскийУчет.УстановитьСубконто(Проводка.СчетКт, Проводка.СубконтоКт, "Контрагенты"	,ВыборкаДетальныеЗаписи.Контрагент);
				БухгалтерскийУчет.УстановитьСубконто(Проводка.СчетКт, Проводка.СубконтоКт, "Договоры"		,ВыборкаДетальныеЗаписи.Договор);
				
				Проводка.СчетДт                  = ПланыСчетов.Хозрасчетный.ПрочиеРасходыНеОблагаемыеЕНВД;
				БухгалтерскийУчет.УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, "ПрочиеДоходыИРасходы"		,Проц);
		       БухгалтерскийУчет.УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, "ПодразделениеОрганизации", Подразделение);
				//проведение по НУ
				ПроводкаНУ = ПроводкиНУ.Добавить();
				
				ПроводкаНУ.Период               = Дата;
				ПроводкаНУ.Организация          = Организация;
				ПроводкаНУ.Содержание           = "начисление процентов по кредитам и займам в НУ";
				ПроводкаНУ.ВидУчетаДт           = Перечисления.ВидыУчетаПоПБУ18.НУ;
				ПроводкаНУ.Сумма                = ВыборкаДетальныеЗаписи.ПоНс;
				ПроводкаНУ.СчетДт               = ПланыСчетов.Налоговый.ВнереализационныеРасходы;//ПланыСчетов.Налоговый.ВнереализационныеДоходы; //Blik 230414 испр
				БухгалтерскийУчет.УстановитьСубконто(ПроводкаНУ.СчетДт, ПроводкаНУ.СубконтоДт, "ПрочиеДоходыИРасходы"		,Проц);
				//Blik 230414 доб н
				ПроводкаНУ.СчетКт               = ПланыСчетов.Налоговый.ПоступлениеИВыбытиеИмуществаРаботУслугПрав; 
				ПроводкаНУ.ВидУчетаКт           = Перечисления.ВидыУчетаПоПБУ18.НУ;
				БухгалтерскийУчет.УстановитьСубконто(ПроводкаНУ.СчетКт, ПроводкаНУ.СубконтоКт, "УсловияПоступленияИВыбытия"	,Перечисления.УсловияПоступленияИВыбытияИмущества.ПоДоговоруЗайма);
				БухгалтерскийУчет.УстановитьСубконто(ПроводкаНУ.СчетКт, ПроводкаНУ.СубконтоКт, "Контрагенты"	,ВыборкаДетальныеЗаписи.Контрагент);
				БухгалтерскийУчет.УстановитьСубконто(ПроводкаНУ.СчетКт, ПроводкаНУ.СубконтоКт, "Договоры"		,ВыборкаДетальныеЗаписи.Договор);
				//Blik 230414 доб к

				//списываем остаток ПоФс-ПоНС эту часть суммы не можем принять к ну 
				Проводка   = ПроводкиБУ.Добавить();
				
				Проводка.Период                  = Дата;
				Проводка.Организация             = Организация;
				Проводка.Содержание              = "начисление процентов по кредитам и займам  не принимаемые к НУ ";
				Проводка.Сумма                   = ВыборкаДетальныеЗаписи.ПоФС-ВыборкаДетальныеЗаписи.ПоНС;
				Проводка.СчетКт                  = ВыборкаДетальныеЗаписи.СчетКт;
				
				БухгалтерскийУчет.УстановитьСубконто(Проводка.СчетКт, Проводка.СубконтоКт, "Контрагенты"	,ВыборкаДетальныеЗаписи.Контрагент);
				БухгалтерскийУчет.УстановитьСубконто(Проводка.СчетКт, Проводка.СубконтоКт, "Договоры"		,ВыборкаДетальныеЗаписи.Договор);
				
				Проводка.СчетДт                  = ПланыСчетов.Хозрасчетный.ПрочиеРасходыНеОблагаемыеЕНВД;
				БухгалтерскийУчет.УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, "ПрочиеДоходыИРасходы"		,ПроцСН);
				БухгалтерскийУчет.УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, "ПодразделениеОрганизации", Подразделение);
				//проведение по НУ
				ПроводкаНУ = ПроводкиНУ.Добавить();
				
				ПроводкаНУ.Период               = Дата;
				ПроводкаНУ.Организация          = Организация;
				ПроводкаНУ.Содержание           = "начисление процентов по кредитам и займам в НУ";
				ПроводкаНУ.ВидУчетаДт           = Перечисления.ВидыУчетаПоПБУ18.ПР;
				ПроводкаНУ.Сумма                = ВыборкаДетальныеЗаписи.ПоФс-ВыборкаДетальныеЗаписи.ПоНс;
				ПроводкаНУ.СчетДт               = ПланыСчетов.Налоговый.ВнереализационныеРасходы;//ПланыСчетов.Налоговый.ВнереализационныеДоходы; //Blik 230414 испр
				БухгалтерскийУчет.УстановитьСубконто(ПроводкаНУ.СчетДт, ПроводкаНУ.СубконтоДт, "ПрочиеДоходыИРасходы"		,ПроцСН);
                //Blik 230414 доб н
				ПроводкаНУ.СчетКт               = ПланыСчетов.Налоговый.ПоступлениеИВыбытиеИмуществаРаботУслугПрав; 
				ПроводкаНУ.ВидУчетаКт           = Перечисления.ВидыУчетаПоПБУ18.НУ;
				БухгалтерскийУчет.УстановитьСубконто(ПроводкаНУ.СчетКт, ПроводкаНУ.СубконтоКт, "УсловияПоступленияИВыбытия"	,Перечисления.УсловияПоступленияИВыбытияИмущества.ПоДоговоруЗайма);
				БухгалтерскийУчет.УстановитьСубконто(ПроводкаНУ.СчетКт, ПроводкаНУ.СубконтоКт, "Контрагенты"	,ВыборкаДетальныеЗаписи.Контрагент);
				БухгалтерскийУчет.УстановитьСубконто(ПроводкаНУ.СчетКт, ПроводкаНУ.СубконтоКт, "Договоры"		,ВыборкаДетальныеЗаписи.Договор);
				//доп проводка
				ПроводкаНУ = ПроводкиНУ.Добавить();
				ПроводкаНУ.Период               = Дата;
				ПроводкаНУ.Организация          = Организация;
				ПроводкаНУ.Содержание           = "начисление процентов по кредитам и займам в НУ";
				ПроводкаНУ.ВидУчетаДт           = Перечисления.ВидыУчетаПоПБУ18.НУ;
				ПроводкаНУ.Сумма                = ВыборкаДетальныеЗаписи.ПоФс-ВыборкаДетальныеЗаписи.ПоНс;
				ПроводкаНУ.СчетДт               = ПланыСчетов.Налоговый.ВнереализационныеРасходыНеУчитываемые;
				//Blik 230414 доб к

			КонецЕсли;
		Иначе
						
			Если ВыборкаДетальныеЗаписи.ПоСрУр>0 Тогда   //расчет если есть суммы по ср уровню начисления
				Если ВыборкаДетальныеЗаписи.ПоФс<ВыборкаДетальныеЗаписи.ПоСрУр Тогда 
					//списываем все что начислили можем приянть к ну
					Проводка   = ПроводкиБУ.Добавить();
					
					Проводка.Период                  = Дата;
					Проводка.Организация             = Организация;
					Проводка.Содержание              = "начисление процентов по кредитам и займам за ";
					Проводка.сумма                   = ВыборкаДетальныеЗаписи.ПоФС;
					Если ВыборкаДетальныеЗаписи.СчетКт.Валютный Тогда
						Проводка.ВалютнаяСуммаКт    = ВыборкаДетальныеЗаписи.НачислениеПоФс; 
						Проводка.ВалютаКт             = ВыборкаДетальныеЗаписи.Валюта;
					КонецЕсли;
					Проводка.СчетКт                  = ВыборкаДетальныеЗаписи.СчетКт;
					
					БухгалтерскийУчет.УстановитьСубконто(Проводка.СчетКт, Проводка.СубконтоКт, "Контрагенты"	,ВыборкаДетальныеЗаписи.Контрагент);
					БухгалтерскийУчет.УстановитьСубконто(Проводка.СчетКт, Проводка.СубконтоКт, "Договоры"		,ВыборкаДетальныеЗаписи.Договор);
					
					Проводка.СчетДт                  = ПланыСчетов.Хозрасчетный.ПрочиеРасходыНеОблагаемыеЕНВД;
					
					БухгалтерскийУчет.УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, "ПрочиеДоходыИРасходы"		,Проц);
					БухгалтерскийУчет.УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, "ПодразделениеОрганизации", Подразделение);
					//проведение по НУ
					ПроводкаНУ = ПроводкиНУ.Добавить();
					
					ПроводкаНУ.Период               = Дата;
					ПроводкаНУ.Организация          = Организация;
					ПроводкаНУ.Содержание           = "начисление процентов по кредитам и займам в НУ";
					ПроводкаНУ.ВидУчетаДт           = Перечисления.ВидыУчетаПоПБУ18.НУ;
					ПроводкаНУ.Сумма                = ВыборкаДетальныеЗаписи.ПоФс;
					ПроводкаНУ.СчетДт               = ПланыСчетов.Налоговый.ВнереализационныеРасходы;//ПланыСчетов.Налоговый.ВнереализационныеДоходы; //Blik 230414 испр
					БухгалтерскийУчет.УстановитьСубконто(ПроводкаНУ.СчетДт, ПроводкаНУ.СубконтоДт, "ПрочиеДоходыИРасходы"		,Проц);
					//Blik 230414 доб н
					ПроводкаНУ.СчетКт               = ПланыСчетов.Налоговый.ПоступлениеИВыбытиеИмуществаРаботУслугПрав; 
					ПроводкаНУ.ВидУчетаКт           = Перечисления.ВидыУчетаПоПБУ18.НУ;
					БухгалтерскийУчет.УстановитьСубконто(ПроводкаНУ.СчетКт, ПроводкаНУ.СубконтоКт, "УсловияПоступленияИВыбытия"	,Перечисления.УсловияПоступленияИВыбытияИмущества.ПоДоговоруЗайма);
					БухгалтерскийУчет.УстановитьСубконто(ПроводкаНУ.СчетКт, ПроводкаНУ.СубконтоКт, "Контрагенты"	,ВыборкаДетальныеЗаписи.Контрагент);
					БухгалтерскийУчет.УстановитьСубконто(ПроводкаНУ.СчетКт, ПроводкаНУ.СубконтоКт, "Договоры"		,ВыборкаДетальныеЗаписи.Договор);
					//Blik 230414 доб к
				Иначе
					// списываемпо ср уровню, это можно принять к ну
					Проводка   = ПроводкиБУ.Добавить();
					
					Проводка.Период                  = Дата;
					Проводка.Организация             = Организация;
					Проводка.Содержание              = "начисление процентов по кредитам и займам за ";
					Проводка.Сумма                   = ВыборкаДетальныеЗаписи.ПоСрУр;
					Если ВыборкаДетальныеЗаписи.СчетКт.Валютный Тогда
						Проводка.ВалютнаяСуммаКт      = ВыборкаДетальныеЗаписи.НачисленоПоСрУровню; 
						Проводка.ВалютаКт             = ВыборкаДетальныеЗаписи.Валюта;
					КонецЕсли;
					Проводка.СчетКт                  = ВыборкаДетальныеЗаписи.СчетКт;
					
					БухгалтерскийУчет.УстановитьСубконто(Проводка.СчетКт, Проводка.СубконтоКт, "Контрагенты"	,ВыборкаДетальныеЗаписи.Контрагент);
					БухгалтерскийУчет.УстановитьСубконто(Проводка.СчетКт, Проводка.СубконтоКт, "Договоры"		,ВыборкаДетальныеЗаписи.Договор);
					
					Проводка.СчетДт                  = ПланыСчетов.Хозрасчетный.ПрочиеРасходыНеОблагаемыеЕНВД;
					
					БухгалтерскийУчет.УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, "ПрочиеДоходыИРасходы"		,Проц);
					БухгалтерскийУчет.УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, "ПодразделениеОрганизации", Подразделение);
					//проведение по НУ
					ПроводкаНУ = ПроводкиНУ.Добавить();
					
					ПроводкаНУ.Период               = Дата;
					ПроводкаНУ.Организация          = Организация;
					ПроводкаНУ.Содержание           = "начисление процентов по кредитам и займам в НУ";
					ПроводкаНУ.ВидУчетаДт           = Перечисления.ВидыУчетаПоПБУ18.НУ;
					ПроводкаНУ.Сумма                = ВыборкаДетальныеЗаписи.ПоСрУр;
					ПроводкаНУ.СчетДт               = ПланыСчетов.Налоговый.ВнереализационныеРасходы;//ПланыСчетов.Налоговый.ВнереализационныеДоходы; //Blik 230414 испр
					БухгалтерскийУчет.УстановитьСубконто(ПроводкаНУ.СчетДт, ПроводкаНУ.СубконтоДт, "ПрочиеДоходыИРасходы"		,Проц);
					//Blik 230414 доб н
					ПроводкаНУ.СчетКт               = ПланыСчетов.Налоговый.ПоступлениеИВыбытиеИмуществаРаботУслугПрав; 
					ПроводкаНУ.ВидУчетаКт           = Перечисления.ВидыУчетаПоПБУ18.НУ;
					БухгалтерскийУчет.УстановитьСубконто(ПроводкаНУ.СчетКт, ПроводкаНУ.СубконтоКт, "УсловияПоступленияИВыбытия"	,Перечисления.УсловияПоступленияИВыбытияИмущества.ПоДоговоруЗайма);
					БухгалтерскийУчет.УстановитьСубконто(ПроводкаНУ.СчетКт, ПроводкаНУ.СубконтоКт, "Контрагенты"	,ВыборкаДетальныеЗаписи.Контрагент);
					БухгалтерскийУчет.УстановитьСубконто(ПроводкаНУ.СчетКт, ПроводкаНУ.СубконтоКт, "Договоры"		,ВыборкаДетальныеЗаписи.Договор);
					//Blik 230414 доб к
					
					//списываем остаток ПоФс-ПоСрУр эту часть суммы не можем принять к ну 
					Проводка   = ПроводкиБУ.Добавить();
					
					Проводка.Период                  = Дата;
					Проводка.Организация             = Организация;
					Проводка.Содержание              = "начисление процентов по кредитам и займам за ";
					Проводка.Сумма                   = ВыборкаДетальныеЗаписи.ПоФС-ВыборкаДетальныеЗаписи.ПоСрУр;
					Если ВыборкаДетальныеЗаписи.СчетКт.Валютный Тогда
						Проводка.ВалютнаяСуммаКт      = ВыборкаДетальныеЗаписи.НачислениеПоФс- ВыборкаДетальныеЗаписи.НачисленоПоСрУровню; 
						Проводка.ВалютаКт             = ВыборкаДетальныеЗаписи.Валюта;
					КонецЕсли;
					Проводка.СчетКт                  = ВыборкаДетальныеЗаписи.СчетКт;
					
					БухгалтерскийУчет.УстановитьСубконто(Проводка.СчетКт, Проводка.СубконтоКт, "Контрагенты"	,ВыборкаДетальныеЗаписи.Контрагент);
					БухгалтерскийУчет.УстановитьСубконто(Проводка.СчетКт, Проводка.СубконтоКт, "Договоры"		,ВыборкаДетальныеЗаписи.Договор);
					
					Проводка.СчетДт                  = ПланыСчетов.Хозрасчетный.ПрочиеРасходыНеОблагаемыеЕНВД;
					
					БухгалтерскийУчет.УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, "ПрочиеДоходыИРасходы"		,ПроцСН);
					БухгалтерскийУчет.УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, "ПодразделениеОрганизации", Подразделение);
					//проведение по НУ
					ПроводкаНУ = ПроводкиНУ.Добавить();
					ПроводкаНУ.Период               = Дата;
					ПроводкаНУ.Организация          = Организация;
					ПроводкаНУ.Содержание           = "начисление процентов по кредитам и займам в НУ";
					ПроводкаНУ.ВидУчетаДт           = Перечисления.ВидыУчетаПоПБУ18.ПР;
					ПроводкаНУ.Сумма                = ВыборкаДетальныеЗаписи.ПоФС-ВыборкаДетальныеЗаписи.ПоСрУр;
					ПроводкаНУ.СчетДт               = ПланыСчетов.Налоговый.ВнереализационныеРасходы;//ПланыСчетов.Налоговый.ВнереализационныеДоходы; //Blik 230414 испр
					БухгалтерскийУчет.УстановитьСубконто(ПроводкаНУ.СчетДт, ПроводкаНУ.СубконтоДт, "ПрочиеДоходыИРасходы"		,ПроцСН);
					//Blik 230414 доб н
					ПроводкаНУ.СчетКт               = ПланыСчетов.Налоговый.ПоступлениеИВыбытиеИмуществаРаботУслугПрав; 
					ПроводкаНУ.ВидУчетаКт           = Перечисления.ВидыУчетаПоПБУ18.НУ;
					БухгалтерскийУчет.УстановитьСубконто(ПроводкаНУ.СчетКт, ПроводкаНУ.СубконтоКт, "УсловияПоступленияИВыбытия"	,Перечисления.УсловияПоступленияИВыбытияИмущества.ПоДоговоруЗайма);
					БухгалтерскийУчет.УстановитьСубконто(ПроводкаНУ.СчетКт, ПроводкаНУ.СубконтоКт, "Контрагенты"	,ВыборкаДетальныеЗаписи.Контрагент);
					БухгалтерскийУчет.УстановитьСубконто(ПроводкаНУ.СчетКт, ПроводкаНУ.СубконтоКт, "Договоры"		,ВыборкаДетальныеЗаписи.Договор);
					//доп проводка
					ПроводкаНУ = ПроводкиНУ.Добавить();
					ПроводкаНУ.Период               = Дата;
					ПроводкаНУ.Организация          = Организация;
					ПроводкаНУ.Содержание           = "начисление процентов по кредитам и займам в НУ";
					ПроводкаНУ.ВидУчетаДт           = Перечисления.ВидыУчетаПоПБУ18.НУ;
					ПроводкаНУ.Сумма                = ВыборкаДетальныеЗаписи.ПоФс-ВыборкаДетальныеЗаписи.ПоСрУр;
					ПроводкаНУ.СчетДт               = ПланыСчетов.Налоговый.ВнереализационныеРасходыНеУчитываемые;
					//Blik 230414 доб к

				КонецЕсли;
			КонецЕсли;
			Если ВыборкаДетальныеЗаписи.ПоНС>0 Тогда   //расчет если есть суммы по нормируемой ставке
				Если ВыборкаДетальныеЗаписи.ПоФс<ВыборкаДетальныеЗаписи.ПоНС Тогда 
					//списываем все что начислили можем приянть к ну
					Проводка   = ПроводкиБУ.Добавить();
					
					Проводка.Период                  = Дата;
					Проводка.Организация             = Организация;
					Проводка.Содержание              = "начисление процентов по кредитам и займам за ";
					Проводка.Сумма                   = ВыборкаДетальныеЗаписи.ПоФС;
					Если ВыборкаДетальныеЗаписи.СчетКт.Валютный Тогда
						Проводка.ВалютнаяСуммаКт      = ВыборкаДетальныеЗаписи.НачислениеПоФс; 
						Проводка.ВалютаКт             = ВыборкаДетальныеЗаписи.Валюта;
					КонецЕсли;
					Проводка.СчетКт                  = ВыборкаДетальныеЗаписи.СчетКт;
					
					БухгалтерскийУчет.УстановитьСубконто(Проводка.СчетКт, Проводка.СубконтоКт, "Контрагенты"	,ВыборкаДетальныеЗаписи.Контрагент);
					БухгалтерскийУчет.УстановитьСубконто(Проводка.СчетКт, Проводка.СубконтоКт, "Договоры"		,ВыборкаДетальныеЗаписи.Договор);
					
					Проводка.СчетДт                  = ПланыСчетов.Хозрасчетный.ПрочиеРасходыНеОблагаемыеЕНВД;
					
					БухгалтерскийУчет.УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, "ПрочиеДоходыИРасходы"		,Проц);
					БухгалтерскийУчет.УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, "ПодразделениеОрганизации", Подразделение);
					//проведение по НУ
					ПроводкаНУ = ПроводкиНУ.Добавить();
					
					ПроводкаНУ.Период               = Дата;
					ПроводкаНУ.Организация          = Организация;
					ПроводкаНУ.Содержание           = "начисление процентов по кредитам и займам в НУ";
					ПроводкаНУ.ВидУчетаДт           = Перечисления.ВидыУчетаПоПБУ18.НУ;
					ПроводкаНУ.Сумма                = ВыборкаДетальныеЗаписи.ПоФС;
					ПроводкаНУ.СчетДт               = ПланыСчетов.Налоговый.ВнереализационныеРасходы;//ПланыСчетов.Налоговый.ВнереализационныеДоходы; //Blik 230414 испр
					БухгалтерскийУчет.УстановитьСубконто(ПроводкаНУ.СчетДт, ПроводкаНУ.СубконтоДт, "ПрочиеДоходыИРасходы"		,Проц);
					//Blik 230414 доб н
					ПроводкаНУ.СчетКт               = ПланыСчетов.Налоговый.ПоступлениеИВыбытиеИмуществаРаботУслугПрав; 
					ПроводкаНУ.ВидУчетаКт           = Перечисления.ВидыУчетаПоПБУ18.НУ;
					БухгалтерскийУчет.УстановитьСубконто(ПроводкаНУ.СчетКт, ПроводкаНУ.СубконтоКт, "УсловияПоступленияИВыбытия"	,Перечисления.УсловияПоступленияИВыбытияИмущества.ПоДоговоруЗайма);
					БухгалтерскийУчет.УстановитьСубконто(ПроводкаНУ.СчетКт, ПроводкаНУ.СубконтоКт, "Контрагенты"	,ВыборкаДетальныеЗаписи.Контрагент);
					БухгалтерскийУчет.УстановитьСубконто(ПроводкаНУ.СчетКт, ПроводкаНУ.СубконтоКт, "Договоры"		,ВыборкаДетальныеЗаписи.Договор);
					//Blik 230414 доб к
				Иначе
					// списываемпо по нормируемой ставке, это можно принять к ну
					Проводка   = ПроводкиБУ.Добавить();
					
					Проводка.Период                  = Дата;
					Проводка.Организация             = Организация;
					Проводка.Содержание              = "начисление процентов по кредитам и займам за ";
					Проводка.Сумма                   = ВыборкаДетальныеЗаписи.ПоНС;
					Если ВыборкаДетальныеЗаписи.СчетКт.Валютный Тогда
						Проводка.ВалютнаяСуммаКт      = ВыборкаДетальныеЗаписи.НачисленоПоНС; 
						Проводка.ВалютаКт             = ВыборкаДетальныеЗаписи.Валюта;
					КонецЕсли;
					Проводка.СчетКт                  = ВыборкаДетальныеЗаписи.СчетКт;
					
					БухгалтерскийУчет.УстановитьСубконто(Проводка.СчетКт, Проводка.СубконтоКт, "Контрагенты"	,ВыборкаДетальныеЗаписи.Контрагент);
					БухгалтерскийУчет.УстановитьСубконто(Проводка.СчетКт, Проводка.СубконтоКт, "Договоры"		,ВыборкаДетальныеЗаписи.Договор);
					
					Проводка.СчетДт                  = ПланыСчетов.Хозрасчетный.ПрочиеРасходыНеОблагаемыеЕНВД;
					
					БухгалтерскийУчет.УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, "ПрочиеДоходыИРасходы"		,Проц);
					БухгалтерскийУчет.УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, "ПодразделениеОрганизации", Подразделение);
					//проведение по НУ
					ПроводкаНУ = ПроводкиНУ.Добавить();
					
					ПроводкаНУ.Период               = Дата;
					ПроводкаНУ.Организация          = Организация;
					ПроводкаНУ.Содержание           = "начисление процентов по кредитам и займам в НУ";
					ПроводкаНУ.ВидУчетаДт           = Перечисления.ВидыУчетаПоПБУ18.НУ;
					ПроводкаНУ.Сумма                = ВыборкаДетальныеЗаписи.ПоНС;
					ПроводкаНУ.СчетДт               = ПланыСчетов.Налоговый.ВнереализационныеРасходы;//ПланыСчетов.Налоговый.ВнереализационныеДоходы; //Blik 230414 испр
					БухгалтерскийУчет.УстановитьСубконто(ПроводкаНУ.СчетДт, ПроводкаНУ.СубконтоДт, "ПрочиеДоходыИРасходы"		,Проц);
					//Blik 230414 доб н
					ПроводкаНУ.СчетКт               = ПланыСчетов.Налоговый.ПоступлениеИВыбытиеИмуществаРаботУслугПрав; 
					ПроводкаНУ.ВидУчетаКт           = Перечисления.ВидыУчетаПоПБУ18.НУ;
					БухгалтерскийУчет.УстановитьСубконто(ПроводкаНУ.СчетКт, ПроводкаНУ.СубконтоКт, "УсловияПоступленияИВыбытия"	,Перечисления.УсловияПоступленияИВыбытияИмущества.ПоДоговоруЗайма);
					БухгалтерскийУчет.УстановитьСубконто(ПроводкаНУ.СчетКт, ПроводкаНУ.СубконтоКт, "Контрагенты"	,ВыборкаДетальныеЗаписи.Контрагент);
					БухгалтерскийУчет.УстановитьСубконто(ПроводкаНУ.СчетКт, ПроводкаНУ.СубконтоКт, "Договоры"		,ВыборкаДетальныеЗаписи.Договор);
					//Blik 230414 доб к
					//списываем остаток ПоФс-ПоНС эту часть суммы не можем принять к ну 
					Проводка   = ПроводкиБУ.Добавить();
					
					Проводка.Период                  = Дата;
					Проводка.Организация             = Организация;
					Проводка.Содержание              = "начисление процентов по кредитам и займам  не принимаемые к НУ ";
					Проводка.Сумма                   = ВыборкаДетальныеЗаписи.ПоФС-ВыборкаДетальныеЗаписи.ПоНС;
					Если ВыборкаДетальныеЗаписи.СчетКт.Валютный Тогда
						Проводка.ВалютнаяСуммаКт      = ВыборкаДетальныеЗаписи.НачислениеПоФс- ВыборкаДетальныеЗаписи.НачисленоПоНС; 
						Проводка.ВалютаКт             = ВыборкаДетальныеЗаписи.Валюта;
					КонецЕсли;
					Проводка.СчетКт                  = ВыборкаДетальныеЗаписи.СчетКт;
					
					БухгалтерскийУчет.УстановитьСубконто(Проводка.СчетКт, Проводка.СубконтоКт, "Контрагенты"	,ВыборкаДетальныеЗаписи.Контрагент);
					БухгалтерскийУчет.УстановитьСубконто(Проводка.СчетКт, Проводка.СубконтоКт, "Договоры"		,ВыборкаДетальныеЗаписи.Договор);
					
					Проводка.СчетДт                  = ПланыСчетов.Хозрасчетный.ПрочиеРасходыНеОблагаемыеЕНВД;
					
					БухгалтерскийУчет.УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, "ПрочиеДоходыИРасходы"		,ПроцСН);
					БухгалтерскийУчет.УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, "ПодразделениеОрганизации", Подразделение);
					//проведение по НУ
					ПроводкаНУ = ПроводкиНУ.Добавить();
					
					ПроводкаНУ.Период               = Дата;
					ПроводкаНУ.Организация          = Организация;
					ПроводкаНУ.Содержание           = "начисление процентов по кредитам и займам в НУ";
					ПроводкаНУ.ВидУчетаДт           = Перечисления.ВидыУчетаПоПБУ18.ПР;
					ПроводкаНУ.Сумма                = ВыборкаДетальныеЗаписи.ПоФС-ВыборкаДетальныеЗаписи.ПоНС;
					ПроводкаНУ.СчетДт               = ПланыСчетов.Налоговый.ВнереализационныеРасходы;//ПланыСчетов.Налоговый.ВнереализационныеДоходы; //Blik 230414 испр
					БухгалтерскийУчет.УстановитьСубконто(ПроводкаНУ.СчетДт, ПроводкаНУ.СубконтоДт, "ПрочиеДоходыИРасходы"		,ПроцСН);
					//Blik 230414 доб н
					ПроводкаНУ.СчетКт               = ПланыСчетов.Налоговый.ПоступлениеИВыбытиеИмуществаРаботУслугПрав; 
					ПроводкаНУ.ВидУчетаКт           = Перечисления.ВидыУчетаПоПБУ18.НУ;
					БухгалтерскийУчет.УстановитьСубконто(ПроводкаНУ.СчетКт, ПроводкаНУ.СубконтоКт, "УсловияПоступленияИВыбытия"	,Перечисления.УсловияПоступленияИВыбытияИмущества.ПоДоговоруЗайма);
					БухгалтерскийУчет.УстановитьСубконто(ПроводкаНУ.СчетКт, ПроводкаНУ.СубконтоКт, "Контрагенты"	,ВыборкаДетальныеЗаписи.Контрагент);
					БухгалтерскийУчет.УстановитьСубконто(ПроводкаНУ.СчетКт, ПроводкаНУ.СубконтоКт, "Договоры"		,ВыборкаДетальныеЗаписи.Договор);
					//доп проводка
					ПроводкаНУ = ПроводкиНУ.Добавить();
					ПроводкаНУ.Период               = Дата;
					ПроводкаНУ.Организация          = Организация;
					ПроводкаНУ.Содержание           = "начисление процентов по кредитам и займам в НУ";
					ПроводкаНУ.ВидУчетаДт           = Перечисления.ВидыУчетаПоПБУ18.НУ;
					ПроводкаНУ.Сумма                = ВыборкаДетальныеЗаписи.ПоФс-ВыборкаДетальныеЗаписи.ПоНс;
					ПроводкаНУ.СчетДт               = ПланыСчетов.Налоговый.ВнереализационныеРасходыНеУчитываемые;
					//Blik 230414 доб к
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
КонецФункции

Функция ФормированиеПроводок_НовыеПравила(ВыборкаДетальныеЗаписи,ПроводкиБУ,ПроводкиНУ,Проц,ПроцСн)
	
	//Сообщить("Формирование проводок по новым правилам");	
	
	Если Ссылка.Рубли = Истина тогда
		
		//списываем все что начислили и можем приянть к ну
		Проводка   = ПроводкиБУ.Добавить();
		
		Проводка.Период                  = Дата;
		Проводка.Организация             = Организация;
		Проводка.Содержание              = "начисление процентов по кредитам и займам за ";
		Проводка.Сумма                   = ВыборкаДетальныеЗаписи.ПоФс;
		Проводка.СчетКт                  = ВыборкаДетальныеЗаписи.СчетКт;
		
		БухгалтерскийУчет.УстановитьСубконто(Проводка.СчетКт, Проводка.СубконтоКт, "Контрагенты"	,ВыборкаДетальныеЗаписи.Контрагент);
		БухгалтерскийУчет.УстановитьСубконто(Проводка.СчетКт, Проводка.СубконтоКт, "Договоры"		,ВыборкаДетальныеЗаписи.Договор);
		
		Проводка.СчетДт                  = ПланыСчетов.Хозрасчетный.ПрочиеРасходыНеОблагаемыеЕНВД;
		БухгалтерскийУчет.УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, "ПрочиеДоходыИРасходы"		,Проц);
		БухгалтерскийУчет.УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, "ПодразделениеОрганизации", Подразделение);
		
		//проведение по НУ
		ПроводкаНУ = ПроводкиНУ.Добавить();
		
		ПроводкаНУ.Период               = Дата;
		ПроводкаНУ.Организация          = Организация;
		ПроводкаНУ.Содержание           = "начисление процентов по кредитам и займам в НУ";
		ПроводкаНУ.ВидУчетаДт           = Перечисления.ВидыУчетаПоПБУ18.НУ;
		ПроводкаНУ.Сумма                = ВыборкаДетальныеЗаписи.ПоФс;
		ПроводкаНУ.СчетДт               = ПланыСчетов.Налоговый.ВнереализационныеРасходы;//ПланыСчетов.Налоговый.ВнереализационныеДоходы; //Blik 230414 испр
		БухгалтерскийУчет.УстановитьСубконто(ПроводкаНУ.СчетДт, ПроводкаНУ.СубконтоДт, "ПрочиеДоходыИРасходы"		,Проц);
		//Blik 230414 доб н
		ПроводкаНУ.СчетКт               = ПланыСчетов.Налоговый.ПоступлениеИВыбытиеИмуществаРаботУслугПрав; 
		ПроводкаНУ.ВидУчетаКт           = Перечисления.ВидыУчетаПоПБУ18.НУ;
		БухгалтерскийУчет.УстановитьСубконто(ПроводкаНУ.СчетКт, ПроводкаНУ.СубконтоКт, "УсловияПоступленияИВыбытия"	,Перечисления.УсловияПоступленияИВыбытияИмущества.ПоДоговоруЗайма);
		БухгалтерскийУчет.УстановитьСубконто(ПроводкаНУ.СчетКт, ПроводкаНУ.СубконтоКт, "Контрагенты"	,ВыборкаДетальныеЗаписи.Контрагент);
		БухгалтерскийУчет.УстановитьСубконто(ПроводкаНУ.СчетКт, ПроводкаНУ.СубконтоКт, "Договоры"		,ВыборкаДетальныеЗаписи.Договор);
		//Blik 230414 доб к
	Иначе
		
		//списываем все что начислили и можем приянть к ну
		Проводка   = ПроводкиБУ.Добавить();
		
		Проводка.Период                  = Дата;
		Проводка.Организация             = Организация;
		Проводка.Содержание              = "начисление процентов по кредитам и займам за ";
		Проводка.Сумма                   = ВыборкаДетальныеЗаписи.ПоФС;
		Если ВыборкаДетальныеЗаписи.СчетКт.Валютный Тогда
			Проводка.ВалютнаяСуммаКт      = ВыборкаДетальныеЗаписи.НачислениеПоФс; 
			Проводка.ВалютаКт             = ВыборкаДетальныеЗаписи.Валюта;
		КонецЕсли;
		Проводка.СчетКт                  = ВыборкаДетальныеЗаписи.СчетКт;
		
		БухгалтерскийУчет.УстановитьСубконто(Проводка.СчетКт, Проводка.СубконтоКт, "Контрагенты"	,ВыборкаДетальныеЗаписи.Контрагент);
		БухгалтерскийУчет.УстановитьСубконто(Проводка.СчетКт, Проводка.СубконтоКт, "Договоры"		,ВыборкаДетальныеЗаписи.Договор);
		
		Проводка.СчетДт                  = ПланыСчетов.Хозрасчетный.ПрочиеРасходыНеОблагаемыеЕНВД;
		
		БухгалтерскийУчет.УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, "ПрочиеДоходыИРасходы"		,Проц);
		БухгалтерскийУчет.УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, "ПодразделениеОрганизации", Подразделение);
		//проведение по НУ
		ПроводкаНУ = ПроводкиНУ.Добавить();
		
		ПроводкаНУ.Период               = Дата;
		ПроводкаНУ.Организация          = Организация;
		ПроводкаНУ.Содержание           = "начисление процентов по кредитам и займам в НУ";
		ПроводкаНУ.ВидУчетаДт           = Перечисления.ВидыУчетаПоПБУ18.НУ;
		ПроводкаНУ.Сумма                = ВыборкаДетальныеЗаписи.ПоФС;
		ПроводкаНУ.СчетДт               = ПланыСчетов.Налоговый.ВнереализационныеРасходы;//ПланыСчетов.Налоговый.ВнереализационныеДоходы; //Blik 230414 испр
		БухгалтерскийУчет.УстановитьСубконто(ПроводкаНУ.СчетДт, ПроводкаНУ.СубконтоДт, "ПрочиеДоходыИРасходы"		,Проц);
		//Blik 230414 доб н
		ПроводкаНУ.СчетКт               = ПланыСчетов.Налоговый.ПоступлениеИВыбытиеИмуществаРаботУслугПрав; 
		ПроводкаНУ.ВидУчетаКт           = Перечисления.ВидыУчетаПоПБУ18.НУ;
		БухгалтерскийУчет.УстановитьСубконто(ПроводкаНУ.СчетКт, ПроводкаНУ.СубконтоКт, "УсловияПоступленияИВыбытия"	,Перечисления.УсловияПоступленияИВыбытияИмущества.ПоДоговоруЗайма);
		БухгалтерскийУчет.УстановитьСубконто(ПроводкаНУ.СчетКт, ПроводкаНУ.СубконтоКт, "Контрагенты"	,ВыборкаДетальныеЗаписи.Контрагент);
		БухгалтерскийУчет.УстановитьСубконто(ПроводкаНУ.СчетКт, ПроводкаНУ.СубконтоКт, "Договоры"		,ВыборкаДетальныеЗаписи.Договор);
		//Blik 230414 доб к
	КонецЕсли;
КонецФункции
//Blik 230517 65309
